RT-Thread/rt-thread/bsp/stm32/libraries/STM32H5xx_HAL/STM32H5xx_HAL_Driver/Inc/stm32h5xx_ll_opamp.h
/** @defgroup OPAMP_LL_EC_FUNCTIONAL_MODE OPAMP functional mode
  * @{
  */
#define LL_OPAMP_MODE_STANDALONE       0x00000000U            /*!< OPAMP functional mode, OPAMP operation
                                                                   in standalone                                      */
#define LL_OPAMP_MODE_FOLLOWER         (OPAMP_CSR_VMSEL_1 |\
                                        OPAMP_CSR_VMSEL_0)    /*!< OPAMP functional mode, OPAMP operation in follower */
#define LL_OPAMP_MODE_PGA              (OPAMP_CSR_VMSEL_1)    /*!< OPAMP functional mode, OPAMP operation in PGA      */
#define LL_OPAMP_MODE_PGA_IO0          (OPAMP_CSR_PGGAIN_2|\
                                        OPAMP_CSR_VMSEL_1)    /*!< In PGA mode, the inverting input is connected
                                                                   to VINM0 for filtering                             */
#define LL_OPAMP_MODE_PGA_IO0_BIAS     (OPAMP_CSR_PGGAIN_3|\
                                        OPAMP_CSR_VMSEL_1)    /*!< In PGA mode, the inverting input is
                                                                   connected to VINM0.
                                                                   - Input signal on VINM0, bias on VINPx: negative gain
                                                                   - Bias on VINM0, input signal on VINPx:
                                                                     positive gain                                    */
#define LL_OPAMP_MODE_PGA_IO0_IO1_BIAS (OPAMP_CSR_PGGAIN_3|\
                                        OPAMP_CSR_PGGAIN_2|\
                                        OPAMP_CSR_VMSEL_1)    /*!< In PGA mode, the inverting input is
                                                                   connected to VINM0.
                                                                   - Input signal on VINM0, bias on VINPx: negative gain
                                                                   - Bias on VINM0, input signal on VINPx: positive gain
                                                                     And VINM1 is connected too for filtering         */
/**
  * @}
  */

/** @defgroup OPAMP_LL_EC_MODE_PGA_GAIN OPAMP PGA gain (relevant when OPAMP is in functional mode PGA)
  * @note Gain sign:
  *         - is positive if the @ref OPAMP_LL_EC_FUNCTIONAL_MODE configuration is
  *           @ref LL_OPAMP_MODE_PGA or LL_OPAMP_MODE_PGA_IO0
  *         - may be positive or negative if the @ref OPAMP_LL_EC_FUNCTIONAL_MODE configuration is
  *           @ref LL_OPAMP_MODE_PGA_IO0_BIAS or LL_OPAMP_MODE_PGA_IO0_IO1_BIAS
  *       see @ref OPAMP_LL_EC_FUNCTIONAL_MODE for more details
  * @{
  */
#define LL_OPAMP_PGA_GAIN_2_OR_MINUS_1   0x00000000U                               /*!< OPAMP PGA gain 2  or -1  */
#define LL_OPAMP_PGA_GAIN_4_OR_MINUS_3   (OPAMP_CSR_PGGAIN_0)                      /*!< OPAMP PGA gain 4  or -3  */
#define LL_OPAMP_PGA_GAIN_8_OR_MINUS_7   (OPAMP_CSR_PGGAIN_1)                      /*!< OPAMP PGA gain 8  or -7  */
#define LL_OPAMP_PGA_GAIN_16_OR_MINUS_15 (OPAMP_CSR_PGGAIN_1 | OPAMP_CSR_PGGAIN_0) /*!< OPAMP PGA gain 16 or -15 */
/**
  * @}
  */

/** @defgroup OPAMP_LL_EC_INPUT_NONINVERTING OPAMP input non-inverting
  * @{
  */
#define LL_OPAMP_INPUT_NONINVERT_IO0 0x00000000U       /*!< OPAMP non inverting input connected to I/O VINP0
                                                            (PB0  for OPAMP1)
                                                            Note: On this STM32 series, all OPAMPx are not available on
                                                            all devices. Refer to device datasheet for more details   */
#define LL_OPAMP_INPUT_NONINVERT_IO1 OPAMP_CSR_VPSEL_1 /*!< OPAMP non inverting input connected to I/O VINP2
                                                            (PA0  for OPAMP1)
                                                            Note: On this STM32 series, all OPAMPx are not available on
                                                            all devices. Refer to device datasheet for more details   */
#define LL_OPAMP_INPUT_NONINVERT_DAC OPAMP_CSR_VPSEL_0 /*!< OPAMP non inverting input connected internally to DAC channel
                                                            (DAC1_CH1 for OPAMP1)
                                                            Note: On this STM32 series, all OPAMPx are not available on
                                                            all devices. Refer to device datasheet for more details   */

/**
  * @}
  */

/** @defgroup OPAMP_LL_EC_INPUT_INVERTING OPAMP input inverting
  * @note OPAMP inverting input is used with OPAMP in mode standalone or PGA with negative gain or bias.
  *       Otherwise (OPAMP in mode follower), OPAMP inverting input is not used (not connected to GPIO pin).
  * @{
  */
#define LL_OPAMP_INPUT_INVERT_IO0         0x00000000U       /*!< OPAMP inverting input connected to I/O VINM0
                                                                 (PC5  for OPAMP1)
                                                                 Note: On this STM32 series, all OPAMPx are not
                                                                 available on all devices. Refer to device datasheet
                                                                 for more details                                     */
#define LL_OPAMP_INPUT_INVERT_IO1         OPAMP_CSR_VMSEL_0 /*!< OPAMP inverting input connected to I/0 VINM1
                                                                 (PB1  for OPAMP1)
                                                                 Note: On this STM32 series, all OPAMPx are not
                                                                 available on all devices. Refer to device datasheet
                                                                 for more details                                     */
#define LL_OPAMP_INPUT_INVERT_CONNECT_NO  OPAMP_CSR_VMSEL_1 /*!< OPAMP inverting input not externally connected
                                                                (intended for OPAMP in mode follower or PGA with
                                                                 positive gain without bias).
                                                                 Note: On this STM32 series, this literal include cases
                                                                 of value 0x11 for mode follower and value 0x10
                                                                 for mode PGA.                                        */
/**
  * @}
  */



/** @defgroup OPAMP_LL_EC_POWER_MODE OPAMP PowerMode
  * @{
  */
#define LL_OPAMP_POWERMODE_NORMAL    (OPAMP_POWERMODE_OTR_REGOFFSET)                      /*!< OPAMP output in
                                                                                               normal mode            */
#define LL_OPAMP_POWERMODE_HIGHSPEED (OPAMP_POWERMODE_HSOTR_REGOFFSET | OPAMP_CSR_OPAHSM) /*!< OPAMP output in
                                                                                               highspeed mode         */
/**
  * @}
  */

/** @defgroup OPAMP_LL_EC_TRIMMING_MODE OPAMP trimming mode
  * @{
  */
#define LL_OPAMP_TRIMMING_FACTORY       0x00000000U             /*!< OPAMP trimming factors set to factory values */
#define LL_OPAMP_TRIMMING_USER          OPAMP_CSR_USERTRIM      /*!< OPAMP trimming factors set to user values    */
/**
  * @}
  */

/** @defgroup OPAMP_LL_EC_TRIMMING_TRANSISTORS_DIFF_PAIR OPAMP trimming of transistors differential pair NMOS or PMOS
  * @{
  */
#define LL_OPAMP_TRIMMING_NMOS_VREF_90PC_VDDA  (OPAMP_OTR_TRIMOFFSETN |\
                                                ((OPAMP_CSR_CALSEL_1 |\
                                                  OPAMP_CSR_CALSEL_0) << 4)) /*!< OPAMP trimming of transistors
                                                                                  differential pair NMOS (internal
                                                                                  reference voltage set to 0.9*Vdda).
                                                                                  Default parameters to be used for
                                                                                  calibration using two trimming steps
                                                                                  (one with each transistors
                                                                                  differential pair NMOS and PMOS).   */
#define LL_OPAMP_TRIMMING_NMOS_VREF_50PC_VDDA  (OPAMP_OTR_TRIMOFFSETN |\
                                                (OPAMP_CSR_CALSEL_1 << 4))   /*!< OPAMP trimming of transistors
                                                                                  differential pair NMOS (internal
                                                                                  reference voltage set to 0.5*Vdda). */
#define LL_OPAMP_TRIMMING_PMOS_VREF_10PC_VDDA  (OPAMP_OTR_TRIMOFFSETP |\
                                                (OPAMP_CSR_CALSEL_0 << 4))   /*!< OPAMP trimming of transistors
                                                                                  differential pair PMOS (internal
                                                                                  reference voltage set to 0.1*Vdda).
                                                                                  Default parameters to be used
                                                                                  for calibration using two trimming
                                                                                  steps (one with each transistors
                                                                                  differential pair NMOS and PMOS).   */
#define LL_OPAMP_TRIMMING_PMOS_VREF_3_3PC_VDDA (OPAMP_OTR_TRIMOFFSETP)       /*!< OPAMP trimming of transistors
                                                                                  differential pair PMOS (internal
                                                                                  reference voltage set to 0.33*Vdda).*/
#define LL_OPAMP_TRIMMING_NMOS (LL_OPAMP_TRIMMING_NMOS_VREF_90PC_VDDA)       /*!< OPAMP trimming of transistors
                                                                                  differential pair NMOS (internal
                                                                                  reference voltage setto 0.9*Vdda).
                                                                                  Default parameters to be used
                                                                                  for calibration using two trimming
                                                                                  steps (one with each transistors
                                                                                  differential pair NMOS and PMOS).   */
#define LL_OPAMP_TRIMMING_PMOS (LL_OPAMP_TRIMMING_PMOS_VREF_10PC_VDDA)       /*!< OPAMP trimming of transistors
                                                                                  differential pair PMOS (internal
                                                                                  reference voltage setto 0.1*Vdda).
                                                                                  Default parameters to be used for
                                                                                  calibration using two trimming
                                                                                  steps one with each transistors
                                                                                  differential pair NMOS and PMOS).   */
/**
  * @}
  */

/** @defgroup OPAMP_LL_EC_HW_DELAYS  Definitions of OPAMP hardware constraints delays
  * @note   Only OPAMP Peripheral HW delays are defined in OPAMP LL driver driver,
  *         not timeout values.
  *         For details on delays values, refer to descriptions in source code
  *         above each literal definition.
  * @{
  */

/* Delay for OPAMP startup time (transition from state disable to enable).    */
/* Note: OPAMP startup time depends on board application environment:         */
/*       impedance connected to OPAMP output.                                 */
/*       The delay below is specified under conditions:                       */
/*        - OPAMP in functional mode follower                                 */
/*        - load impedance of 4kOhm (min), 50pF (max)                         */
/* Literal set to maximum value (refer to device datasheet,                   */
/* parameter "tWAKEUP").                                                      */
/* Unit: us                                                                   */
#define LL_OPAMP_DELAY_STARTUP_US         (3U)  /*!< Delay for OPAMP startup time */
/**
  * @}
  */

/**
  * @}
  */

